imjustadog/string-jn5168-stm32f103/Project/STM32F10x_StdPeriph_Template/main.c
/**
  ******************************************************************************
  * @file    TIM/InputCapture/main.c 
  * @author  MCD Application Team
  * @version V3.5.0
  * @date    08-April-2011
  * @brief   Main program body
  ******************************************************************************
  * @attention
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY
  * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * <h2><center>&copy; COPYRIGHT 2011 STMicroelectronics</center></h2>
  ******************************************************************************
  */ 

/* Includes ------------------------------------------------------------------*/
#include "stm32f10x.h"
#include "stm32f10x_it.h"
#include "project.h"
#include <stdio.h>
#include <math.h>

#define PUTCHAR_PROTOTYPE int fputc(int ch, FILE *f)
/** @addtogroup STM32F10x_StdPeriph_Examples
  * @{
  */

/** @addtogroup TIM_Input_Capture
  * @{
  */ 

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
TIM_ICInitTypeDef  TIM_ICInitStructure;
EXTI_InitTypeDef   EXTI_InitStructure;
EXTI_InitTypeDef   EXTI_InitStructure;
GPIO_InitTypeDef   GPIO_InitStructure;
NVIC_InitTypeDef   NVIC_InitStructure;
USART_InitTypeDef  USART_InitStructure;
SPI_InitTypeDef   SPI_InitStructure;

/* Private function prototypes -----------------------------------------------*/
void RCC_Configuration(void);
void GPIO_Configuration(void);
void NVIC_Configuration(void);
void USART_Configuration(void);
void SPI_Configuration(void);
void ADC_Configuration(void);
void MEASUREMENT(int group);
void DELAY(__IO uint32_t nCount);
void init_timer(void);
void init_dma(void);
void dma_NVIC(void);

uint16_t Capture[6][30]={0};

volatile uint8_t state = 0;
volatile uint8_t sending = 0;
volatile uint8_t send_flag = 0;
volatile uint8_t capture_flag = 0;

char mode='R';
uint32_t size=25;
float Frequency = 0;
float Frequency_last[6];
float Temperature = 0;
float cycleaverage[6] = {0};

unsigned int board_num =0xAAAA;
uint8_t module_per_group = 1;

int STIMULATE_LOW[6] = {
	200,
	200,
	200,
	200,
	200,
	200};

int STIMULATE_HIGH[6] = {
	2200,
	2200,
	2200,
	2200,
	2200,
	2200};

	
float	A = 0.0014051f;
float B = 0.0002369f;
float C = 0.0000001019f;

void uart_zigbee_senddata(uint8_t *str);
void uart_485_senddata(uint8_t *str, uint8_t num);
UART_SendTypeDef UART_SendEnum  = SEND_NONE;

uint8_t volt_buf[4] = {'S', 0, 0, 'E'};

uint8_t data_buf[36] = {
	'S',
	0,0,//ID
	0,0,0,0,0, //CH1 频率高8位 频率低8位 温度高8位 温度低8位
	1,0,0,0,0, //CH2 频率高8位 频率低8位 温度高8位 温度低8位
	2,0,0,0,0, //CH3 频率高8位 频率低8位 温度高8位 温度低8位
	3,0,0,0,0, //CH4 频率高8位 频率低8位 温度高8位 温度低8位 
	4,0,0,0,0, //CH5 频率高8位 频率低8位 温度高8位 温度低8位 
	5,0,0,0,0, //CH6 频率高8位 频率低8位 温度高8位 温度低8位 
	0,0,       //电量高8位 电量低8位
  'E'};

uint8_t start_buf[36] = {
	'S',
	0,0,//ID
	0,0,0,0,
	0,0,0,0,
	0,0,0,0,
	0,0,0,0,
	0,0,0,0,
	0,0,0,0,
	0,0,0,0,
	'A',
	0xff,
	0x02,
	0xff,
  'A'};

uint8_t reply_buf[36] = {
	'S',
	0,0,//ID
	0,0,0,0,
	0,0,0,0,
	0,0,0,0,
	0,0,0,0,
	0,0,0,0,
	0,0,0,0,
	0,0,0,0,
	0xff,
	0xff,
	0x00,
	0xff,
  'A'};

uint8_t adc_channel_map[6] = {
	ADC_Channel_10,
	ADC_Channel_11,
	ADC_Channel_12,
	ADC_Channel_13,
	ADC_Channel_0,
	ADC_Channel_1};
	
GPIO_TypeDef* STRING_GPIO[6] = {
	GPIOC, 
	GPIOC, 
  GPIOA, 
  GPIOA, 
  GPIOA, 
  GPIOA};

uint16_t STRING_PIN[6] = {
	STRING_PIN_CEA, 
  STRING_PIN_CEB, 
  STRING_PIN_CEC, 
  STRING_PIN_CED, 
  STRING_PIN_CEE, 
  STRING_PIN_CEF};

DMA_Channel_TypeDef* STRING_DMA_CHANNEL[6] = {
	DMA1_Channel1, 
	DMA1_Channel7, 
	DMA1_Channel2, 
	DMA1_Channel3, 
	DMA1_Channel5, 
	DMA1_Channel6};

TIM_TypeDef* STRING_TIM[6] = {
	TIM2, 
  TIM2, 
	TIM3, 
	TIM3, 
	TIM4, 
  TIM3};
	
/* Private functions ---------------------------------------------------------*/
/*void TEST()
{
	unsigned int i,j,k;
	
	i = 2100;	
  while(i>=1000)
	{
		j = 200;

		GPIO_SetBits(STRING_GPIO[0], STRING_PIN[0]);  
			
		while(j)
		{    
				__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();
				j = j - 1;
		}  
		
		j = 200;
		GPIO_ResetBits(STRING_GPIO[0], STRING_PIN[0]); 			
		while(j)
		{  
			 __nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();
			 j = j - 1;
		}    
		
		i = i - 1; 
	}
	
	DELAY(1500);                                                                                                                                                                                                                       
}	
*/	
	
	
void write_to_data_buf(int num,uint16_t Freq, uint16_t Temp)
{
	data_buf[3 + num * 5 + 1] = (uint8_t)((Freq&0xff00)>>8);
	data_buf[3 + num * 5 + 2] = (uint8_t)(Freq&0x00ff);
	data_buf[3 + num * 5 + 3] = (uint8_t)((Temp&0xff00)>>8);
	data_buf[3 + num * 5 + 4] = (uint8_t)(Temp&0x00ff);
}

float get_temperature(int ch)
{
	int i;
	float result = 0;
	ADC_RegularChannelConfig(ADC1, adc_channel_map[ch], 1, ADC_SampleTime_239Cycles5);			    
  for(i=0;i<8;i++)
	{
		ADC_SoftwareStartConvCmd(ADC1, ENABLE);
		while(!ADC_GetFlagStatus(ADC1, ADC_FLAG_EOC ));
		result+=ADC_GetConversionValue(ADC1);
	}
	result=result/8;
	return result;
}

void capture()
{
		int i,j;
		float temp_log;
		
	  GPIO_SetBits(GPIOD, RS485_DE); 
		uart_485_senddata(volt_buf, 4);
		GPIO_ResetBits(GPIOD, RS485_DE);
	  
	  GPIO_SetBits(GPIOA, STRING_PIN_SWITCH); 
		DELAY(1000);
		for(i = 0;i < 6;i ++)
		{
			MEASUREMENT(i);
			state = 1;
			TIM_Cmd(STRING_TIM[i], ENABLE); 
			DMA_Cmd(STRING_DMA_CHANNEL[i],ENABLE);			
			while(state == 1) ; 
		}
		while(sending != 0) ;
		for(i = 0;i < 6; i ++)
		{
			Frequency=240000000.0f/cycleaverage[i] + 0.5f;	//10倍真正频率
			Temperature = get_temperature(i);
			
			if(((Frequency_last[i] - Frequency) >= 100) || ((Frequency - Frequency_last[i]) >= 100))
			{
				STIMULATE_HIGH[i] = 2200;
				STIMULATE_LOW[i] = 200;
			}
			else
			{
				STIMULATE_HIGH[i] = 240000000.0f / (Frequency - 0.5f - 1000.0f) / 26.0f;
				STIMULATE_LOW[i] = 240000000.0f / (Frequency - 0.5f + 1000.0f) / 26.0f;
				if(STIMULATE_LOW[i] < 0)
				{
					STIMULATE_LOW[i] = 100;
					STIMULATE_HIGH[i] = 400;
				}
			}
			Frequency_last[i] = Frequency;
			
			//temp_log = log(Temperature);
			//Temperature = (1.0f / (A + B * temp_log + C * temp_log * temp_log * temp_log) - 273.2f) * 100.0f; 
			
			write_to_data_buf(i,(uint16_t)(Frequency),(uint16_t)(Temperature));	
		}
	  GPIO_ResetBits(GPIOA, STRING_PIN_SWITCH);
}
/**
  * @brief  Main program
  * @param  None
  * @retval None
  */
int main(void)
{
	/*!< At this stage the microcontroller clock setting is already configured, 
       this is done through SystemInit() function which is called from startup
       file (startup_stm32f10x_xx.s) before to branch to application main.
       To reconfigure the default setting of SystemInit() function, refer to
       system_stm32f10x.c file
     */     
  RCC_Configuration();
  NVIC_Configuration();
  GPIO_Configuration();
	SPI_Configuration();
	ADC_Configuration();
  init_timer();
	dma_NVIC();
	init_dma();
	USART_Configuration();

  GPIO_SetBits(GPIOA, ZIGBEE_PIN_RESET); //开zigbee
	
	GPIO_ResetBits(GPIOB, BAT_PIN_1);
	GPIO_ResetBits(GPIOC, BAT_PIN_2);
	GPIO_ResetBits(GPIOA, BAT_PIN_3);
	
	data_buf[1] = (board_num >>8)& 0x00FF;
	data_buf[2] = board_num & 0x00ff;
	volt_buf[1] = (board_num >>8)& 0x00FF;
	volt_buf[2] = board_num & 0x00ff;
	
