imjustadog/string-jn5168-stm32f103/Project/STM32F10x_StdPeriph_Template/main.c
	start_buf[1] = data_buf[1];
	start_buf[2] = data_buf[2];
	reply_buf[1] = data_buf[1];
	reply_buf[2] = data_buf[2];

  while (1)
	{
		/*if(capture_flag == 1)
		{
			 capture();
			 capture_flag = 0;
		}
		switch(UART_SendEnum)
		{
			case SEND_DATA:
			{
				if(send_flag == 1)
				{
					uart_zigbee_senddata(data_buf);
					send_flag = 0;
				}					
				break;
			}
			case SEND_NONE:
			{
				break;
			}
			case SEND_START:
			{
				uart_zigbee_senddata(start_buf);
				UART_SendEnum = SEND_DATA;
				break;
			}
			default:break;
		}*/
		//TEST();
		capture();
		GPIO_SetBits(GPIOD, RS485_DE); 
	  uart_485_senddata(data_buf, 36);
		GPIO_ResetBits(GPIOD, RS485_DE);
	}
	
}

/*void get_channel(int ch)
{
	switch(ch)
	{
		case 0:
		{
			STRING_GPIO = GPIOC;
			STRING_PIN = GPIO_Pin_8;
			STRING_TIM = TIM2;
			STRING_DMA_CHANNEL = DMA1_Channel1;
			break;
		}
		case 1:
		{
			STRING_GPIO = GPIOC;
			STRING_PIN = GPIO_Pin_9;
			STRING_TIM = TIM2;
			STRING_DMA_CHANNEL = DMA1_Channel7;
			break;
		}
		case 2:
		{
			STRING_GPIO = GPIOA;
			STRING_PIN = GPIO_Pin_8;
			STRING_TIM = TIM3;
			STRING_DMA_CHANNEL = DMA1_Channel2;
			break;
		}
		case 3:
		{
			STRING_GPIO = GPIOA;
			STRING_PIN = GPIO_Pin_9;
			STRING_TIM = TIM3;
			STRING_DMA_CHANNEL = DMA1_Channel3;
			break;
		}
		case 4:
		{
			STRING_GPIO = GPIOA;
			STRING_PIN = GPIO_Pin_10;
			STRING_TIM = TIM4;
			STRING_DMA_CHANNEL = DMA1_Channel5;
			break;
		}
		case 5:
		{
			STRING_GPIO = GPIOA;
			STRING_PIN = GPIO_Pin_11;
			STRING_TIM = TIM3;
			STRING_DMA_CHANNEL = DMA1_Channel6;
			break;
		}
		default:break;
	}
}*/

/**
  * @brief  Configures the different system clocks.
  * @param  None
  * @retval None
  */
void RCC_Configuration(void)
{
  /* TIM3 clock enable */
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM3, ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC1, ENABLE);
	RCC_ADCCLKConfig(RCC_PCLK2_Div6);   

  /* GPIOA and GPIOB clock enable */
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC, ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOD, ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO, ENABLE);
}

void dma_NVIC(void)
{
  NVIC_InitTypeDef NVIC_InitStructure;
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;

	NVIC_InitStructure.NVIC_IRQChannel = DMA1_Channel1_IRQn;
  NVIC_Init(&NVIC_InitStructure);
	
  NVIC_InitStructure.NVIC_IRQChannel = DMA1_Channel7_IRQn;
  NVIC_Init(&NVIC_InitStructure);
	
  NVIC_InitStructure.NVIC_IRQChannel = DMA1_Channel2_IRQn;
  NVIC_Init(&NVIC_InitStructure);
	
	NVIC_InitStructure.NVIC_IRQChannel = DMA1_Channel3_IRQn;
  NVIC_Init(&NVIC_InitStructure);
	
	NVIC_InitStructure.NVIC_IRQChannel = DMA1_Channel5_IRQn;
  NVIC_Init(&NVIC_InitStructure);
	
	NVIC_InitStructure.NVIC_IRQChannel = DMA1_Channel6_IRQn;
  NVIC_Init(&NVIC_InitStructure);
	
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 2;
	NVIC_InitStructure.NVIC_IRQChannel = TIM6_DAC_IRQn;
	NVIC_Init(&NVIC_InitStructure);
}

 void init_dma(void)
 { 
    DMA_InitTypeDef DMA_InitStructure;
	  DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralSRC;
    DMA_InitStructure.DMA_BufferSize = size;
    DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
    DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
    DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_HalfWord;
    DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_HalfWord;
    DMA_InitStructure.DMA_Mode = DMA_Mode_Circular;
    DMA_InitStructure.DMA_Priority = DMA_Priority_High;
    DMA_InitStructure.DMA_M2M = DMA_M2M_Disable;
  
	  RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE);	 
	 /*PHZ1*/
	  DMA_DeInit(DMA1_Channel1);
    DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)(&TIM2->CCR3);
    DMA_InitStructure.DMA_MemoryBaseAddr = (uint32_t)Capture[0];
	 	DMA_Init(DMA1_Channel1,&DMA_InitStructure);              
    DMA_ITConfig(DMA1_Channel1, DMA_IT_TC, ENABLE);

	  /*PHZ2*/
	 	DMA_DeInit(DMA1_Channel7);
    DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)(&TIM2->CCR4);
    DMA_InitStructure.DMA_MemoryBaseAddr = (uint32_t)Capture[1];
	  DMA_Init(DMA1_Channel7,&DMA_InitStructure);              
    DMA_ITConfig(DMA1_Channel7, DMA_IT_TC, ENABLE);
		
		/*PHZ3*/
	  DMA_DeInit(DMA1_Channel2);
    DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)(&TIM3->CCR3);
    DMA_InitStructure.DMA_MemoryBaseAddr = (uint32_t)Capture[2];
 	  DMA_Init(DMA1_Channel2,&DMA_InitStructure);              
    DMA_ITConfig(DMA1_Channel2, DMA_IT_TC, ENABLE);
		
		/*PHZ4*/
	  DMA_DeInit(DMA1_Channel3);
    DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)(&TIM3->CCR4);
    DMA_InitStructure.DMA_MemoryBaseAddr = (uint32_t)Capture[3];
 	  DMA_Init(DMA1_Channel3,&DMA_InitStructure);              
    DMA_ITConfig(DMA1_Channel3, DMA_IT_TC, ENABLE);
		
		/*PHZ5*/
	  DMA_DeInit(DMA1_Channel5);
    DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)(&TIM4->CCR3);
    DMA_InitStructure.DMA_MemoryBaseAddr = (uint32_t)Capture[4];
 	  DMA_Init(DMA1_Channel5,&DMA_InitStructure);              
    DMA_ITConfig(DMA1_Channel5, DMA_IT_TC, ENABLE);
		
		/*PHZ6*/
	  DMA_DeInit(DMA1_Channel6);
    DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)(&TIM3->CCR1);
    DMA_InitStructure.DMA_MemoryBaseAddr = (uint32_t)Capture[5];
    DMA_Init(DMA1_Channel6,&DMA_InitStructure);              
    DMA_ITConfig(DMA1_Channel6, DMA_IT_TC, ENABLE);
		
		DMA_Cmd(DMA1_Channel1,DISABLE);	 
		DMA_Cmd(DMA1_Channel7,DISABLE);	 
		DMA_Cmd(DMA1_Channel2,DISABLE);	 
		DMA_Cmd(DMA1_Channel3,DISABLE);	 
		DMA_Cmd(DMA1_Channel5,DISABLE);	 
		DMA_Cmd(DMA1_Channel6,DISABLE);	 
 }

 void init_timer(void)
{
    TIM_TimeBaseInitTypeDef timInitStruct;
    TIM_ICInitTypeDef tim_icinit;
	
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2,ENABLE);
	  RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM3,ENABLE);
	  RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM4,ENABLE);
		RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM6,ENABLE);
  
	  timInitStruct.TIM_ClockDivision = TIM_CKD_DIV1;                
    timInitStruct.TIM_Prescaler = 0;                    
    timInitStruct.TIM_CounterMode = TIM_CounterMode_Up;     
    timInitStruct.TIM_RepetitionCounter = 0;  
    timInitStruct.TIM_Period = 0xffff; 
	
	  TIM_DeInit(TIM2);
    TIM_InternalClockConfig(TIM2);                                
	  TIM_TimeBaseInit(TIM2, &timInitStruct);
  
